{
  "data": [
    {
      "data": "On the way back from IMC6 (San Jose, California), all five (mind you, three of us hardcore Kamal fans) of us had reached a unanimous verdict; VV was solid crap and thanks to the movie we were going to have a pretty screwed up Monday. Not to mention, we swore to stay off the theatres for the next year.<br /><br />I won't blame Kamal here because he sort of dropped a hint in a recent interview with cartoonist Madan (on Vijay TV). He said something like, \"Tamizh Cinema'la Photography, Editing'la namba munnera'na maadri Screenplay, Direction, Acting'la innum namba munnera'la\" (Tamil Cinema has grown in terms of Photography and Editing, but we have hardly improved, when it comes to Screenplay, Direction and Acting\"). While you're watching VV, those words ring very true.<br /><br />Now, here are the 10 Reasons to hate this movie:<br /><br />1. Harris Jeyaraj<br /><br />2. Harris Jeyaraj<br /><br />3. Harris Jeyaraj I'm barely holding myself from using expletives here, but fact is HJ has mastered the fine knack of screwing up every recent movie of his (remember 'Anniyan', 'Ghajini') with the jarring cacophony, he bills as background music. The next time I have an eardrum transplant, he's paying for it. <br /><br />4. Songs Neither do the songs help move the movie's narration spatially/temporally nor do they make you sit up and take notice. The film feels like it's made of four VERY long songs with a few scenes thrown in between them.<br /><br />5. A Short gone too far. VV at best is fit to be a short story, not a 2 hour plus \"thriller\". To use a cliché here, like the Energizer bunny it goes on and on and on; only in this case you don't want it to. The later part of a movie feels like a big drag.<br /><br />6. Kamal-Jothika pairing Two ice cubes rubbed together could've produced more sparks than this lead pairing. There's no reason you would root for them to make it together. In fact every time they get together in the second half of the movie, they make a good irritant to the narration. Hate to say this, but Kamalini Mukerjhee's 10 minute romancing does more than what Kamal and Jothika achieve in this movie plus 'Thenali'.<br /><br />7. Kamal Haasan's accent Kamal has this pretentious accent that nobody speaks either in India or in the US; and it isn't new either. He's been doing it since 'Thoongadae Thambi Thoongadae'. It's simply gets on the nerve. Imagine what havoc it can cause when his flair for using this strange accent meets shooting on location in the US. He doesn't leave it at the Immigration either, he offers doses of advice to his men (bewildered TN Cops from Keeranor, Sathoor and beyond) in chaste Kamanglish (\"Wha we hav here is plain bad police wok\"), of course with nauseating effect.<br /><br />8. Logic There are a few directors whom you expect to stand up to a certain scale. Gautam fails us badly with some crappy performance in the Department of common sense. Which D.C.P in his senses would meet his love interest on the streets to discuss such matters as committing himself and life after! The scene inside the theatre was so bad, towards the climax; we could hear people behind us loudly challenge the Hero's IQ. \"Is he stupid, can't he just use his Siren or Lights?\" (On a busy Madras road, Kamal-the-cop-on-a-police-Jeep chases a guy on a bike just like any ordinary dude!). \"Can't he just use his gun?\" (\"The guy on a bike\" starts on foot and we have a fully geared Kamal in hot pursuit for a considerable amount of time). I'm not voting in favour of the later, but I'm just trying to explain the mood inside.<br /><br />9. Gore & Violence If I wanted to watch women being raped, their throats getting slashed, more women getting raped and thrown into the bushes with excruciating authenticity, I would sit at home and rather watch a \"Police Report\" or \"Kuttram\". The use of excessive violence should go in a way to extend the story, not overwhelm it! Somewhere down the line Gautum seems confused about what the extensions (rapes, murders) are and what the mainstay (story) is!<br /><br />10. Even a double shot Espresso couldn't get the pain out of the head.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I have to admit, I picked this movie just for the cast, and while Sutherland, Scacchi, and Prochnow were - as usual - great performers, the rest of the movie was such a let down. It feels like it was put together by a team of adolescents with low level scripts, that is, scripts lacking any depth, awful photography and editing, and hilariously lousy score! I can't believe I was able to watch this seemingly long movie until the end... the sad thing is, this could have actually been a great political thriller given the interesting plot. All the potential was there to make it a hit; that is, two main ingredients are there: a great story of national conspiracies, and a great core cast (even though many other actors are pretty much soap opera quality). But maybe I'm missing something; until then it's still not worth more than a 3 in my opinion.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "this show just sucks. i don't think i even need to say it or why because judging by the number of comments already i am just repeating everything. keys to the vip is like turning on your TV and having it throw poo at you. that is exactly what it is like i am not even exaggerating even a little bit. these guys are so stupid, not funny and not smooth with the ladies that it's not even funny-casue-its-stupid. i sat through four episodes and i want my two hours back. where do they find the contestants because they are obviously deficient mentally. if i was the man who came up with this idea for a show and put it on TV i would do the world a favour and jump off the tallest building i could find. how does garbage like this get on TV? especially the comedy network shouldn't a show on something called the comedy network at least be a comedy show or maybe be funny so often?",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Uhhh ... so, did they even have writers for this? Maybe I'm picky, but I like a little dialog with my movies. And, as far as slasher films go, just a sliver of character development will suffice.<br /><br />Unfortunately, The Prey provides neither\u0097and if you think I'm being hyperbolic, you'll just have to see it for yourself. Scene after scene, we just get actors standing around, looking forlorn and awkward, abandoned by any sense of a script. Outside of calling out each other's names when they get separated in the woods (natch), the only instances where these people say something substantive is when one character explains the constellation Orion (clearly plagiarized from Funk & Wagnalls; scintillating slasher fare, no?) and another rehashes an old campfire tale that doesn't even have anything to do with the plot (wait, what IS the plot?) At other times, The Prey actually has the gall to film its characters with the boom mic just far away enough so that we can't exactly hear what they're saying. So we get entire scenes wherein the actors are murmuring! Deliberately! Seriously, I've seen more dialog in a silent film. It's as if the filmmakers sat down at a bar somewhere in Rancho Cucamonga in the heyday of the '80s slasher craze and one looked at the other and said, \"Hey, I gotta really sweet idea for a gory decapitation gag. Let's somehow pad an entire feature around it.\" And ... well, they did. <br /><br />To be fair, The Prey probably had some sort of writer on board. I mean, somebody had to jot down the scene sequence and label the dailies. However, I am fully convinced that this film did not have an editor of any kind whatsoever. There are glaring pauses, boring tableaux, and zero sense of pacing throughout. The filmmakers don't have anything else in the \"script\" to film, so they fill out the running time with exhaustive taxonomies of the flora and fauna that inhabit the forest in which our wild and crazy teens are getting sliced and diced. These critters are all filmed in straightforward, noontime daylight in a completely reserved fashion and with no attempt at atmospheric photography. If it feels like a science film, that's because it is. I'm pretty sure this is all nature show stock footage\u0097all that's missing is a stuffy narration from some National Geographic alderman.<br /><br />More exciting footage that was graciously spared from the cutting room floor: a scene in which two men discuss cucumber and cream cheese sandwiches, and another scene wherein a supporting character strums away on a banjo for what feels like an entire minute-and-a- half! A minute-and-a-half! That's a lot of banjoing to commit to celluloid to begin with, let alone insert into the final cut of the film! Way to go, guys! Brevity and concision are the real victims of this slaughterfest.<br /><br />Admittedly, the film picks up quite a bit of steam (comparatively) in the last 25 minutes, into which much of the carnage is condensed and where a rip-off of Béla Bartók's \"Music for Strings, Percussion and Celesta\" cuts in. Vaudeville great Jackie Coogan makes a fun appearance as a tubby, bumbly park ranger (this was his last role, if you can believe it). And there are some nice gory moments, including a splattery neck tearing and the aforementioned decapitation. The make-up used for the killer (Carel Struycken, aka \"Lurch\" from the Addams Family movies) is also quite effective, and makes him look like a strange hybrid of young Jason Voorhees and Freddy Krueger. Plus, if you love wacky, straight-outta-left-field endings, you need to check out how they wrap this puppy up. You'll do a spit take, I promise.<br /><br />Usually, I love films that are on this level of ineptitude, but the first three-quarters of The Prey are just so interminably boring that they pretty much spoil the rest. Overall, this is a largely pallid and tedious affair, and, while it ain't all bad, it should really only be seen by debilitated slasher completists. Why do we do this to ourselves, anyway?",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "There's a good story well hidden and never really used! <br /><br />The film is short and overly dependent on action and thematic photography; somehow, character and story development have been forgotten. What is left is muddled and superficial.<br /><br />Turn off your brain and watch\u0097you will probably find that the time goes quickly enough, but unless you are the sort of person that finds soaps deep and meaningful, you are going to get no real satisfaction from this film.<br /><br />Watch only if you have nothing better to do and then only if someone else pays for the video rental.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "... And being let down bigger than ever before. I won't make any direct references or anything here, but to say the least, this film is pathetic. If you're military trained, don't bother watching. I put it on the DVD with 2 friends wanting to watch a somewhat interesting action / war flick. Why couldn't I just have read the reviews first.<br /><br />Already at the first \"bomb\" scene the film has huge glitches, and they continue to show and become bigger and bigger. My 2 friends, not connected to the military in any way spotted a couple of the filmmaker's mistakes almost as fast as I myself did and asked me if some of the things going on we're realistic. Well, as you might have guessed, they're not - at all.<br /><br />Avoid this movie unless you're able to overlook these completely idiotic and re-occurring mistakes being made. 2/10 for catching my interest at first.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Big hair, big boobs, bad music and a giant safety pin.......these are the words to best describe this terrible movie. I love cheesy horror movies and i've seen hundreds..but this had got to be on of the worst ever made. The plot is paper thin and ridiculous, the acting is an abomination, the script is completely laughable(the best is the end showdown with the cop and how he worked out who the killer is-it's just so damn terribly written), the clothes are sickening and funny in equal measures, the hair is big, lots of boobs bounce, men wear those cut tee-shirts that show off their stomachs(sickening that men actually wore them!!) and the music is just synthesiser trash that plays over and over again...in almost every scene there is trashy music, boobs and paramedics taking away bodies....and the gym still doesn't close for bereavement!! All joking aside this is a truly bad film whose only charm is to look back on the disaster that was the 80's and have a good old laugh at how bad everything was back then.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Ghoulies IV starts in a museum storage facility where PVC & leather clad blonde Alexandra (Stacie Randall) is looking for a ancient jewel, after offing various guards she summon the demon Faust who she worships & wants to have sex with, unfortunately she lost the jewel so he's not very happy & orders her to get the last remaining one... Which belongs to Jonathan Graves (returning from the original Ghoulies (1985) Peter Liapis) who is experienced in demonic possession & stuff like that after the events of the original Ghoulies. Alexandra sets about finding the jewel so she can bring Faust to Earth permanently from the 'other side' to, well I don't know actually. Erm, that's about it really...<br /><br />Directed by Jim Wynorski whose very name name sends shivers down my spine when it's attached to a film I'm about to waste 90 minutes of my life on Goulies IV is as I expected complete, total & utter crap from start to finish & it's as simple & straight forward as that. The ,ahem, 'script' , cough, by Mark Sevi has virtually nothing in common with the other Ghoulies film except in it's title & that they managed to convince Liapis to reprise his role which also has the added bonus of big able to use footage from the original even though it has no relevance whatsoever. The story is almost none existent, the whole film is a real chore to watch, it's incredibly boring & moronic, it's slow, it's predictable, it's squeaky clean as far as blood or gore goes & it has two comic relief goblins whom I assume are supposed to fill the Ghoulies quota even though they look nothing like they did in the previous films & are in fact just embarrassing to watch, in fact I think they were practising to be ventriloquist's during most of the film as when they speak their mouth's don't move... You know I don't want to talk or think about Ghoulies IV anymore so please believe me when I say this is one huge piece of crap of Elephant sized proportions, don't waste either your time or money.<br /><br />Dirctor Wynorski turns in a throughly rotten film on just about every level, the special effects are terrible as is the whole film. Apparently Ghoulies IV is meant to be some sort of horror comedy but it misses both targets by the proverbial mile & it is neither funny nor scary. The best thing about this film is actress Randall in her PVC & leather outfit running around trying to find the jewel & that's hardly worth sitting through this rubbish to see. There's a half decent runaway car scene with a few crashes but it looks like it was edited in from a completely different film & given Wynorski's track record I'm sure it was. Forget about any gore as there isn't any.<br /><br />Technically Ghoulies IV sucks, it's obvious it had & low budget but that simply isn't an excuse for it to be this bad, is it? Liapis is back in the cast although he probably wishes he'd stayed away, PVC clad babe Randall is easily the best thing about this film which says a lot.<br /><br />Ghoulies IV is crap, there's nothing else to say really. I honestly can't see anyone who enjoy films getting anything out of this, I just can't. I can't believe that I'm going to recommend the original Ghoulies over anything but it's going to happen now because even though that's crap as well it's a hell of a lot better than Ghoulies IV, one to avoid folks & you can thank me later. The things I sit through so you don't have to, honestly...",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I wouldn't say this totally sucked, but if it wasn't for Netflix I wouldn't even have this in my house. Steve Martin's eccentric president of a chain of health food stores falls flat. He's just not funny. He's another in a LONG slew of SNL rejects that can only find work whoring themselves to the next SNL movie. The birthing coach with the Elmer Fudd lisp is about as funny as it is original. Amy Poehler simply goes through the same motions she would for a 7 minute SNL skit which is about as funny as SNL lately. The only thing going for this movie is that Tina Fey is easy on the eyes. The ending was predictable as soon as you heard her character couldn't get pregnant. The subject matter could have opened up to other comedic attempts, but it seems to simple simmer along, not really entertaining or creating laughs.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Another of my delves into the bargain bin, this movie gave me exactly what I expected - a load of trashy horror complete with screaming ladies.<br /><br />It all started so well - I liked the little intro with the \"newsreel\" about the young couple being exposed to a nuclear blast, and was totally absorbed right up until the first person caught fire...<br /><br />From then onwards the film descended into outright silliness, and at times became almost embarrassing to watch. When the heroine turned out to have been afflicted with the same condition as the main character (the ability to light one's own farts without the aid of a match) it seemed almost as if someone had thrown the idea in at the last moment (\"that'll be good!\" you can almost hear them say...) As for the almost psychic link between the main character and the nuclear power plant, well...<br /><br />The movie came across as cheap tat - if you pay more than £1.50 for it you've been done.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "<br /><br />Paul Verhoeven finally bombed out on this one. He became a joke on himself. Once again we have a film which includes sex and violence, immorality, leering at women and lots of attitiude talk between the characters and dollying pans.<br /><br />Its all for nothing. Because their is no action at all in this film. It fudges all its set pieces. All the actors give the kind of performances form a Verhoeven film. In other words rampant over acting on almost every level. Starship Troopers got away with it because it was such a macho world the characters inhabited. In this scientists are acting the same way. Sorry Paul but Soldiers and scientist are not really made of the same mindset.<br /><br />One major flaw in the plot was that after escaping for that one night to do evil things Kevin Bacons character then returns back to the science lab where we have already spent more then enough time watching these animated manniquens (Elizabeth Shue excepted) walk and talk. Why not show the extent of what the character could do in the outside world. How could they possibly track him if he could be anywhere at all??? Think os all the different things that could have been done with this concept, both in terms of story and characterisation. Then look at what this film does and you really how badly done and concieved the whole project really was.<br /><br />More insulting is the Doco on the DVD where everyone is claiming that Verhoeven is some kind of MAd Genius. Well one out of two isnt that bad.<br /><br />This film has nothing of note in it. Just like the title says.<br /><br />Hollow!!!",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Debra Winger's 1987 \"Black Widow\" is MUCH better.<br /><br />This is like a lame version, and Jane Seymour usually does better.<br /><br />Chad Allen is pretty poor in this too. Just playing his usual role as a boring rebellious child.<br /><br />Maybe the both of them being from Dr. Quinn was supposed to make us get excited.<br /><br />If it's on, go grab a copy of \"Black Widow\".",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "<br /><br />Although the lead actress is STRIKINGLY beautiful, the plot stands little chance of acceptance because too many distracting details face the audience during the unfolding of the story.<br /><br />One may believe that middle-class teen-age school girls in the 1950's easily gave away their virginity without thought of marriage to 30-year-old's they barely know, but I doubt it.<br /><br />One may believe that young high school teens are highly self-confident and self-assured as they interact with their elders in complex social situations, but my experience has been, more often than not, teenagers feel very awkward and act clumsy as they experiment in the adult world.<br /><br />One may believe that a experienced medical doctor would not know the pungent oder of Stroptomycin -- the smelly fermenting byproduct of busy earth microbes -- and not detect that some lifeless bland powder is fake, but I think not.<br /><br />One may believe that 30-something-year-old troublemakers can enter into, and hang around inside, a public school rec hall during a school social and make trouble, but I think that school socials are traditionally a protected environment and parents, chaparones and school staff would be around to prevent this.<br /><br />One final nit, throughout Hey Babu Riba the five teenage friends referred to themselves as the foursome. There is probably an explanation why the FIVE were the FOURsome, but because it was never detailed, each reference distracts from each scene.<br /><br />This movie did not ring true for me.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Take \"Rambo,\" mix in some \"Miami Vice,\" slice the budget about 80%, and you've got something that a few ten-year-old boys could come up with if they have a big enough backyard & too much access to \"Penthouse.\" Cop and ex-commando McBain (Busey, and with a name like McBain, you know he's as gritty as they come) is recruited to retrieve an American supertank that has been stolen & hidden in Mexico. Captured with the tank were hardbitten Sgt. Major O'Rourke (Jones) & McBain's former love Devon (Fluegel), the officer in command & now meat for the depraved terrorists/spies/drug peddlers, who have no sense of decency, blah, blah, blah. For an action movie with depraved sex, there's a dearth of action and not much sex. The running joke is that McBain gets shot all the time & survives, keeping the bullets as souvenirs. Apparently the writers didn't see \"The Magnificent Seven\" (\"The man for us is the one who GAVE him that face\"), nor thought to give McBain even a pretense of intelligence. Even for a budget actioner, the production values are poor, with distant shots during dialog and very little movement. The main prop, the tank, is silly enough for an Ed Wood production. Fluegel, who might have been a blonde Julia Roberts (she had a far bigger role in \"Crime Story\" than Julia!) has to go from simpering to frightened to butt-kicking & back again on an instant's notice. Jones, who's been in an amazing array of films, pretty much hits bottom right here. Both he & Busey were probably just out for some easy money & a couple of laughs. Look for talented, future character actor Danny Trejo (\"Heat,\" \"Once Upon a Time in Mexico\") in a stereotyped, menacing bit part. Much too dull even for a guilty pleasure, \"Bulletproof\" is still noisy enough to play when you leave your house but want people to think there's someone home.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I'm not bothered by the sleazy hosts, nor am I bothered by the cynical, self-righteous stance the makers of this crap take.<br /><br />What I AM bothered about is that the vast majority of the episodes are fake. I wouldn't even be surprised if ALL of the episodes were staged. Hence this isn't a reality show but something far worse even than Oprah: garbage television with zero comma zero appeal. Like daily TV soap opera but with more action and fighting and less plot.<br /><br />The premise would have turned out great - if only it had been executed without cheating the viewer. If only this idea were free of all the legal complications/trappings that would most certainly ensue due to what would happen with real people, and what is eventually aired. Hence the only way to create this \"\"\"reality show\"\"\" was to get some rather desperate actors and make them improvise (and what pitiful and unconvincing improvisation it is most of the time!). Shouldn't this be obvious to anyone who finished grade school? Most reviews I read here don't even mention that any of this is fake, let alone that all of it might be. Wishful thinking or just boundless naivety? <br /><br />The actors hired in this pathetic show are the kind of bottom-of-the-barrel unemployed actors who are miserably waiting on tables, waiting eagerly for a call from a talk show (or this crap), which is when they finally get a chance to make several hundred bucks. I even recognized one actress (in the role of \"cheater\") that I saw years earlier in \"The Jerry Springer Show\". And I only saw 6-7 episodes of \"Cheaters\". How many more of these loser actors are there that appeared in Springer and \"Cheaters\" that I don't even know about?<br /><br />However, to compare \"Cheaters\" with Springer isn't fair to the latter. The Springer show is not all fake; a bulk of the episodes are unstaged - hence often highly entertaining. There is no value to be found in \"Cheaters\", unless you're a struggling actor and want to get tips on how NOT to act in front of the camera.<br /><br />The producers use various (very cheap, transparent) tricks to create the illusion of realness, to give their footage that elusive documentary feel. But it's all in vein. In the end, the more intelligent train-wreck-seeking viewer is left with absolutely squat. \"Professional wrestling\" has more credibility than this.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Ty Cobb is, by far, the most interesting and belligerently insane athlete to ever live. His baseball career was unparalleled in absurd statistics, brilliant strategy, and pure unadulterated violence. Every game he played in was a spectacle in human ability and cruelty. So of course, the film about him deals with none of that, instead focusing on the writing of his biography by author Al Stump. Now this isn't such a horrible idea in theory, as Cobb himself slid even further into paranoid dementia as years progressed and the stories of his crazed outbursts even as a senior are shocking even by today's desensitized standards. But instead of focusing on these events, which I guess was simply too interesting, the film is a pseudo fictionalized road film with clichéd a clichéd plot that will cause any knowledgeable Cobb fan to cry vinegar tears. <br /><br />Tommy Lee Jones does quite well as a crotchety Cobb, but somehow manages to overplay his cartoon supervillainy. Most stories about Cobb are barely believable, but to make him even crazier seems both impossible and unnecessary. Robert Wuhl, portraying the writer Al Stump, is a dark vortex of nonexistent talent. He sucks the life out of every scene, trying to make this film his own Nagasaki. There is a reason we never see him as a leading man anymore (Arliss doesn't count. It's barely a show). Even the played out, inevitable \"role reversal\" of Cobb and Stump by the end is made even worse by his pure inability to utter words that don't sound like a poor book on tape narration voice. <br /><br />For all the awful writing and bland film-making on display, there is one sequence which stands out as so far superior to the rest of this failure that accepting it's from the same film is near impossible. A hyper stylized flashback sequence displaying Cobb's overpowering psychology and brutal athleticism while actually playing the game of baseball is pure brilliance. The camera moves in bizarre fashion and the whole event seems like a dream due to the unique playing style of the monster Cobb. Every slide, hit, and tackle are rendered even more forceful due to enhanced sound, and Tommy Lee Jones OWNS the intensity of the master player. It makes the viewer drool over the possibilities of a true biopic of Cobb in his prime with the same actor. It's worth watching the film for this incredible few minutes alone, just to see what could have been. <br /><br />I may be slightly unfair to this film due to my own knowledge of Ty Cobb and wanting it to be something it isn't, but to make such boring, neutered movie about this maniac is nonsensical. I'm glad Ron Shelton's career has slid ever since.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "This show can most accurately be described as TV Bubble-Gum: It's chewing, it has a good taste to it, and it lasts a long time. But, like Bubble-Gum, it can leave a bad taste in your mouth after a few too many chews.<br /><br />This show features very simple questions that take the form of simply games, like Hangman, guessing a simple phrase or guessing items on a short list. Callers are the contestants, and anybody can play.<br /><br />The questions, though, are terribly easy. There's some techno music pumped into the background that's fashioned into a continuous loop. It never seems to get old, but it never adds much to the show anyway. The hostess, however, regardless of which one that it, is extremely personable, pleasant enough to watch and can make some very amusing facial expressions. I rather enjoy that British woman.<br /><br />But there's nothing to this show. It's simplistic and uncompelling, although it can be entertaining if absolutely nothing else is on.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "The movie starts out fine. Widower out with new girlfriend and the children.<br /><br />The movie is filled with stupid director's choices. Like \"lets separate.\" \"I am coming down to....\" do what? Stupid Stupid Stupid.<br /><br />Please do not waste your time hoping that it will get better.............. Not hardly.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "This movie is incomprehendably bad. It begins with several random explosions and then cuts to a sock puppet of a T-Rex that talks (!) to the audience. It goes back and forth between sock puppetry and animation throughout, probably because the film makers couldn't afford live actors. I'll spare you the long, tiresome, relentless plot that drags this pitiful film on for a brutal 85 minutes.<br /><br />One of my friends found this very rare video at a hobby shop somewhere that sells out of print b-movies, and he bought it for the sole purpose of making fun of it, but, as it turns out, our intervention was not neecessary. This film makes fun of itself better than we could.<br /><br />I thought that Ed Wood's \"Plan 9 from Outer Space\" was the cheesiest movie in existence, but leave it to Japanamation/Lego cars/Sock puppets to outdo him. If you see this movie anywhere, buy it without hesitation. It is very rare and worth many, many good laughs.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I stopped watching lost at this episode because I thought Ana-Lucia and Libby's deaths were unnecessary and really depressing. Then I found out that they kept Libby around just to die in the next episode! Gah! I can't handle it.<br /><br />I liked this show for the first season, but it definitely declined in the second season, I found Jack and Locke's little religious feud to be annoying. The deaths of Rodriguez & Watros' characters was the final straw! <br /><br />I give this episode a 4/10, for being the end to my viewing of this formerly great series created by Alias legend J.J. Abrams. I hope his series in the future will improve on this one.",
      "label": 0,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Dead Gentlemen Productions has put together a film with amazing production values considering their budget. Anyone that has ever played any role-playing game, particularly any fantasy RPG (they play Dungeons and Dragons in the movie) will LOVE this movie. Brilliant performances all around--especially with regards to the dual nature of the principles, playing their players and their characters. Anyone who has ever filmed or acted in a student film will appreciate the amount of work and love they put into this project. This movie (and its prequel) is to fantasy movies and role-playing games what Blazing Saddles is to westerns--parody of the highest order. I only have a couple minor complaints about the movie itself, none of which will prevent me from buying the DVD as soon as it's available (only 6 more weeks--I'm counting the days): <br /><br />1. When Lodge is talking to Joanna about joining the gaming group, he hands her a copy of the Dungeons and Dragons Players Handbook and says \"this will tell you everything you need to know.\" The camera hovers too long on a shot of the book, and the moment really seemed like a commercial.<br /><br />2. The jokes are hilarious, but they seem unevenly spread throughout the movie. The last third of the movie, after the almost continuous barrage of visual and verbal humor preceding it, slows down a bit, as if the narrative was catching up with the jokes. Odd, but Blazing Saddles always struck me that way as well. . . and I love that movie, too.<br /><br />One of the narrative strengths of the story is the unresolved nature of the romantic subplot. Will Joanna become the GM's girlfriend? Will she go back to Cass? Or will the three maintain a platonic friendship, deepened by the camaraderie of role-playing? (Yes that sounds sappy, but there are a couple of saccharine moments, particularly when Cass and Lodge \"make up\" at the end.) But the movie spans one week: in terms of human relationships, those questions could not be answered in a week. The fact that the characters' relationships are left undefined strikes me as better than the more classical choices you see in most movies, like the girl gets her prince and they move into the castle, or the prince sinks into the North Atlantic after three trite, tedious, and predictable hours. The writers really seem to have a grasp of the psychology of the characters, and you can see the characters (both the gamers and the player's characters) change over the course of the movie, but not suddenly, and not unbelievably. <br /><br />I would love to hear more wisdom from Brother Silence. \"The man who stands out in darkness is. . . fluorescent.\"",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I have to admit that when first saw Madonna performing Holiday on Top of the Pops many years ago I said to my wife \"another American one hit wonder getting the whole thing wrong!!\" Well she was wearing a fright wig and was appallingly dressed. I have never grown to love her the way my daughter does but I have to eat my words. I do like some of her stuff and sometimes enjoy her filmed concerts. This Confessions tour film is great,even if the music is not(and its not). I was impressed by the staging and concepts. Madonna's own performance was enhanced by the incredible dancers she chose to support her. My daughter was at the London gigs and was crazy about it. The lady (Madge) has proved my initial assessment of her so very wrong!!",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "A bit \"the movie in the movie\" case, or as the theme is virtual game here, which is the reality or even more frightening which reality is the \"real\" one.As any Cronenberg there are organic things, like the pod and that wonderful idea:the organic gun, a weapon made of bones and tissues that shoots teeth. If there are some slower moments, the sets, designs and ideas are there with some thoughts of revolution. Can be not liked because the way the movie is happening is quite unusual and sometimes disturbing, but it's definitely worth it.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I first saw this video 15 years ago. I thought it was excellent then and I still do. I am a former teacher of English (high school and college) and a lover of English Romantic poetry, so Coleridge rates highly with me. Anything which might detract from the beauty of the poem or the power of the story wouldn't get my vote of excellence. In this case, everything works well to engage the viewer, especially high school students. The story is well illustrated for a generation which grew up on television. In addition, the voice of Michael Redgrave adds a sense of authenticity and authority to it. Okay, so there wasn't a big budget for the project. So it wasn't Star Wars and there's no CGI in it. But who can dismiss Gustave Doré illustrations as part of the presentation? The comment above, which in just four lines dismisses the video as a piece of trash, is grossly unfair and unperceptive. I'm a friend of the producer, but that isn't my reason for this comment. Rather, I'm defending a work of artistry which I think has value on all levels. It is well suited to bring Coleridge's poem to students in a way which awakens their appreciation of it and awakens their sympathy for the lesson which the ancient mariner imparts.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Although Flatliners is 15 years old, tonight was my first time ever seeing it. I had heard about the movie Flatliners, but there was never a buzz about it to make me go out and rent it or make a point to see it period. Well, I caught it on one of the premium channels and I must say that it was very good.<br /><br />This movie was about some brilliant young medical students deciding to explore death. They have figured out a way to cause a person to die briefly and bring him/her back to life. Besides the all-star cast, this movie had some serious bite to it. Just the very thought of exploring death is riveting enough, but I really thought the writer & director did an excellent job in giving a different yet hair raising view. This was no generic attempt to thrill, frighten, and make one's mind race... this was the real deal.<br /><br />Instead of making it an empty, superficial, star-studded thriller, this movie had substance. A nail-biter, white knuckle, edge-of-the-seat, hard nose thriller. I give it an 8/10.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "This is a multi-faceted, insightful and bold story about the people in the life of a schizophrenic patient, their (and our) perception and realities. Although the main theme revolves around a delusional young woman, the story delightfully flirts with physics, medicine, religion and even politics as it questions our perceptions about what is true and what is real. Konkona Sensharma beautifully conveys that the world Mithi is living in is as real to her as ours is to us. Within that world, she is logical and her thoughts are internally consistent, not the gibberish that they seem to us in our world.<br /><br />Here are a few outstanding scenes to look out for while watching the movie (don't worry, these are not spoilers). I absolutely loved the way Aparna Sen wove these commentaries into the story.<br /><br />- The references to quantum mechanics and relativity intermingled with the witch-doctor (\"ojha\" in Hindi) performing his religious rituals that he believes will drive away the \"ghosts\" sitting in Mithi's brain. <br /><br />- The doctor prescribing shock-treatment as a solution that is \"believed\" to work <br /><br />- Windows of perception - The scene about the review of Anu's book. <br /><br />- The allusion to illusion in a conversation about a director looking for \"maya\". <br /><br />- News footage of George Bush telling the whole world that there is \"no doubt in his mind\" that there are WMD in Iraq (now, that is not as much about Bush's perception, who I suspect knew the truth, as the gullible public's perception about WMD in Iraq.)<br /><br />- One of the best scenes in the movie is where Mithi tells Anu \"Charu sent this man to beat me\" and Anu dismisses it as a matter of course. Konkona did a fantastic job, bringing out the strange mix of muddled thoughts in a schizophrenic's brain when her world and the real world clash.<br /><br />Aparna Sen was bold, but not bold enough to pose one big question: Is nearly all of mankind delusional to believe in God? She could have inserted some scenes about \"normal\", \"healthy\" people praying to and sacrificing for a Being that no one has ever seen or heard from in all of human history (The ritual/exorcism scene doesn't go far enough). That would be the ultimate question: What is normal? Who's reality is right, the Believer's or the Atheist's?<br /><br />IMHO, this movie is a far more intricate exploration of the schizophrenic mind than \"A Beautiful Mind\". It looks at the minds of not just the sick person, but also the healthy, and does so from many different angles and illuminates our understanding of our own minds and our world. If the former got 4 Oscars, this deserves more - At least one each for story, screenplay, direction, Konkona, and Shabana Azmi. It was truly a treat to watch this movie and I'm glad I bought the DVD for my collection. <br /><br />This was a story very well-told indeed.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "This is one of the funniest movies I've seen in ages. I watched for about 20 minutes, slightly puzzled by what was going on. Then I started to laugh and didn't stop 'til long after the movie ended. Such deadpan satire is rare indeed. Christopher Guest has a true eye for the humor inherent in those who have no sense of humor about themselves (about 90% of white heterosexual males, to start with). As in \"Waiting for Guffman\" Guest nails middle America's idiotic self-importance to the wall. I can hardly wait for his next film.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "For those who like their films full of exploding planets and extreme violence, this is definitely not one to see. In fact, there is very little plot at all (or, at least, very little that could not be summarised in a few seconds: A meets B. Mr A falls for Mrs B and has an affair with her. A and B then fall in love and wonder (at great length) whether to have an affair themselves).<br /><br />This is Cantonese Visconti. Story there is none, but what you DO get is a succession of wonderful images and poignantly trivial music which convey the slow passage of the central characters' emotions. There is also the chance to see one of the world's most beautiful women in a succession of stunningly elegant outfits. For my money, it's worth seeing for that alone. How could this woman ever have been an action heroine? She looks as though she has stepped straight out of the pages of Vogue.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "At first sight this is yet another highschool anime with lots of excuses for 'fanservice', but there is a lot more going on. The 'fanservice' is part of the plot, the main character is a tired cynic (unusual), and most importantly there is a clever plot that ties all the episodes together, and that poses some interesting questions. The episodes are deliberately non-chronological, and it is certainly worth watching the series again in chronological order.<br /><br />The series is worth watching carefully, because there are a lot of casual hints in there that foreshadow and explain things, plus a good number of in-jokes about other series, anime and other.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I sort of liked this Columbo movie its atmosphere, which was real thriller like and its approach even at times reminded me of film-noir, in the movie its first 30 minutes or so. It's really nice and done in a good old fashioned way, with the right camera angles and use of light. It doesn't mean instantly that this movie is a brilliant one though but its solid enough to consider this a good late Columbo movie entry. It's definitely a better movie than the average 'later' Columbo movie entry.<br /><br />26 years after his previous Columbo movie appearance, George Hamilton returns once again to play the main lead opposite Peter Falk, again as the murderer, in a total different and new role of course. I liked him in his role and he was a good Columbo 'villain', who gave the good old Lieutenant some good competition. They had some nice sequences together. Problem with the 'modern' new Columbo movies always sort of had been that it didn't feature a good well known actor opposite Peter Falk. This movie obviously doesn't suffer from this problem. But I must say though that this movie doesn't feature Peter Falk at this best. He has certainly played the character better and his performance isn't quite consistent enough within this movie, which is probably also due to he movie its director Daryl Duke, who also directed the really dreadful movie \"Tai-Pan\", among many other projects.<br /><br />It has a rather good and enjoyable story but the fact that the same sort of plot to cover up the murder had been used before in an earlier Columbo movie also doesn't help of course. It got used before in the 1975 movie \"Columbo: Playback\". Nevertheless it of course also still has plenty enough 'original' moments of its own with its story, even though of course in essence every Columbo movie is more or less the same. But oh well, that is what made the Columbo series so great and consistent. If it ain't broke don't fix it.<br /><br />It also is true that within this movie more clues than usual are left out for the Lieutenant, which doesn't mean that the movie its murderer is more stupid or sloppy but I more see it as the writers being more overly enthusiastic than others. It doesn't make the movie or story bad and it in fact perhaps even makes it more enjoyable, to see Columbo hard at work and discovering all kind of small but important clues. Luckily the movie is also filled with some enjoyable effective relieving Columbo-comedy.<br /><br />Simply a good late Columbo movie entry.<br /><br />7/10",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "\"Fear Of A Black Hat\" is everything the (much weaker) \"CB-4\" SHOULD have been. Rusty Cundieff's satirical eye is ruthless, as he folds, spindles, and mutilates every aspect of hip-hop trends and culture. Does \"FoaBH\" resemble Spinal Tap? Yes, a bit. Is it derivative of Spinal Tap? No, not really. The aim is more focused, the satire is better focused, and to be honest, it's funnier.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "Man's Castle is set in one of those jerry built settlements on vacant land and parks that during these times were called 'Hoovervilles' named after our unfortunate 31st president who got stuck with The Great Depression occurring in his administration. The proposition of this film is that a man's home is still his castle even when it's just a shack in a Hooverville.<br /><br />Spencer Tracy has such a shack and truth be told this guy even in good times would not be working all that much. But in a part very typical for Tracy before he was cast as a priest in San Francisco, the start of a slew of classic roles, he's playing a tough good natured mug who takes in Loretta Young.<br /><br />One of the things about Man's Castle is that it shows the effects of the Depression on women as well as men. Women had some additional strains put on them, if men had trouble finding work, women had it twice as hard. And they were sexually harassed and some resorted to prostitution just for a square meal. Spence takes Loretta Young in who's facing those kind of problems and makes no demands on her in his castle. Pretty soon though they're in love, though Tracy is not the kind to settle down.<br /><br />The love scenes had some extra zing to them because Tracy and Young were having a torrid affair during the shooting of Man's Castle. And both were Catholic and married and in those days that was an insuperable barrier to marriage. Both Tracy and Young took the Catholic faith quite seriously.<br /><br />Also in the cast are Walter Connolly as a kind of father figure for the whole camp, Marjorie Rambeau who's been through all the pitfalls Young might encounter and tries to steer her clear and Arthur Hohl, a really loathsome creep who has his eye on Young as well. Hohl brings the plot of Man's Castle to its climax through his scheming. <br /><br />Man's Castle is grim look at the Great Depression, not the usual movie escapist fare for those trying to avoid that kind of reality in their entertainment.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "''The Sentinel'' is one of the best horror movies already made in the movie's Industry! I think it is very scary as very few movies actually are. Alison Parker is a model with some fame. She dates a lawyer called Michael Lerman, and has as a best friend, another model called Jennifer. Everything was great in her life, until she decides to live alone for some time and rents a beautiful and old apartment.<br /><br />The problem are her neighbors, who are very, VERY strange. Suddenly Alison starts to have health problems and faints with frequency; She also remembers some painful facts about her past that makes her have nightmares or illusions. But everything has a reason, and it has to do with the new house she is living...<br /><br />I personally find ''The Sentinel'' a very creepy movie, and along with ''The Exorcist'' they are two of the scariest movies I already watched. When we discover that Alison's house is only occupied by the priest and herself my blood froze! It's also horrible to see that she needs to become blind in the end of the movie in order to be the new sentinel to keep the monsters away from our world.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "What a great film it is. The notion of nations sending people fighting each other with giant robots is tacky. The ending is not just a fitting one, it's more inspirational.<br /><br />But I am intrigued by the characters. It is a pity we never see the relationship of Achilles and Athena more developed beyond just a couple of kisses and Athena's fear for Achilles's safety. Their romance is very enjoyable.<br /><br />",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "NYC, 2022: The Greenhouse effect, vanished oceans, grinding unemployment and scarcity of water, power and food.. and New York's population has topped 40 million. This is a little gem of a picture, not least because a resource-depleted future is a reality for us 21st Century citizens. <br /><br />The low-budget opening titles of this movie are great: set to music, a low-tech 'tape-slide' sequence composed entirely of archive stills from the dawn of photography right up to 1973, depicts an unspoiled American pastoral developing into a polluted and crowded Hell in less than 2 minutes. Succinct and unambiguous, it's truly memorable. Budget limitations are also behind rather unimaginative cinematography and other constraints, at odds with the story's brilliant premise. The police station sequences are like an episode of some 70's TV detective show, and the other interior sets look basic at best. The budget probably all went on trying to 'futurise' the Soylent Executive's 'Chelsea West' apartment with state-of-the art goodies, meaning the other costumes are perfunctory, some establishing shots are bizarrely underpopulated and the daytime exteriors seemingly all shot through a smoke filter.<br /><br />The memorable scene where Sol and Thorn (Charlton Heston) share a meal of expensive and rare food neatly summarises their society: They enjoy real bourbon, lettuce, celery, tomato, apple, and beef, and we really sense their lip-smacking appreciation of someone else's wealthy privileges.<br /><br />Robinson's pivotal death scene, in which his character is willingly euthenased at a place called 'Home', depicts him immersed in images of the world's once-beautiful flora and fauna as he remembered them, beautifully contrasted with the jaundiced Thorn's dawning realization that the future has been bankrupted, among other horrors.<br /><br />This is one smart film, and its core message is as pertinent today as it was in the early 70s. Yes, I know we're not eating the dead yet, but with our resource-sapping longevity, spiraling poverty gap, corporate global capitalism and unchecked habitat destruction leading to climate change, the lasting prediction of 'Soylent Green' may come to pass.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "The most agile fat guy in martial arts does it again. An early Sammo film that has him imitating his character's hero, Bruce Lee, Sammo is amazingly Lee like in his actions and fighting. The way he slips into Bruce's style and then back to his own, more familiar kung fu is a joy to watch and shows how accomplished and adaptable he is at his art. Throw in a bit of slapstick humour so beloved of this type of flick and this a movie that has it all - comedy (some unintentional, like the fake black guy), action and some incredible fight scenes.<br /><br />A great beer and buddies movie that is worth an hour and a half of anyone's time.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I found this movie to be extremely delightful.I am biased I suppose.I happen to adore Kathy Bates.I found her singing an added pleasure.She has a very nice voice.<br /><br />Ms Bates plays Grace Beasley.The film takes you from her doledrums married life in Chicago to England,the home of her recently murdered singing idol Victor Fox.There she meets his three surviving uppity sisters.She also discovers that Victor leaves behind a male lover,Dirk Simpson.<br /><br />The story leads you on to some surprisingly comedic and heartwarming situations as Grace and Dirk develop a true fondness for each other,after an initial rather rude rejection,on his part.They return to Chicago where they team up with Grace's pint-sized,hilarious daughter-in-law,Maudie,to find the serial killer who murdered Victor.<br /><br />Everyone in the picture did a fine job.Particularly enjoyed Julie Andrews,Lynn Redgrave and Barry Manilow.This movie was fun.It makes you cry.The music is absolutely charming.<br /><br />Other posters here who found problems with any parts of this movie,just don't have a clue.<br /><br />",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I liked this film very much. The story jumps back and forth quite a bit and is not easy to follow. There is no resolution to the story whatsoever, and you are left to wonder what really happened. Since I like that sort of film I enjoyed this. I especially like the \"dating\" scenes between the boys and I was drawn into their lives. And of course any film with a naked Staphane Rideau will get a couple of extra points. ;-)",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "I think a several of America's baseball movies are among the best movies ever made. When this movie was in production and heard it described as a rugby movie. I'd read about the Highland team in the newspapers, but didn't have high expectations for this film about a sport that didn't interest me.<br /><br />Last night I viewed it \"on-demand\" and loved it almost as much as my favorite baseball movies. Ryan Little and the cast and crew did an amazing job. Neil McDonough was especially convincing. As the \"bad dad\" he displayed fine range and a subtle, but moving character arc.<br /><br />I also enjoyed the Pacific Islander actors. I've been fortunate to know many of these fine people and this film captures their wonderful spirit and culture. A flashback showing how the Islander culture became such a key element of Highland's team would have been a excellent addition to the film.<br /><br />Some pretty tacky movies have been shot in Utah recently. It's good to see a quality film like this from the Beehive State.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    },
    {
      "data": "It's too bad iameracing wants to deny the reality of Faulkner's and Clarence Brown's purpose in the creating of the story and film of \"Intruder In The Dust\". I suppose the burden of a history of racism is difficult for any Southerner to bear and I can understand that. But to say that this film was not specifically about racism is ridiculous and inaccurate. YES (to borrow your use of the upper case) iameracing, there are many many many places where blacks and white people in the South get along quite well. But to deny the way that black people were and sometimes still are forced to live, the conditions and injustices they have had to endure are not imaginary. Sometimes black and white people got along because of genuine affection and understanding. Sometimes it was only as long as blacks 'knew their place'. The point of making Juano Hernandez character (in film and print) a somewhat prickly type, not warm and fuzzy, was to underscore the fact that bigotry is wrong in and of itself and human rights are just that for everyone regardless of whether we like a particular individual or not. <br /><br />It would do iameracing good to stop denying the existence of racism and the great harm it has done to Americans of all stripes. The fact is that black people (among others) did not, as a rule, not an exception, receive the benefits of the justice system as even-handedly as whites. Segregation, discrimination and lynching are historical fact. People like iameracing might claim these things were not as widespread as some think and would probably love to exonerate their ancestors and heroes from any connection with such behavior. It would be a wonderful thing if iameracing's Southern ancestors (if any)never participated in any of the horrible racist actions that mar this country's history and I hope they didn't. If that is so congratulations to them but that fact, if true, does not erase the fact that others did. And even if the horrible things that were done to blacks in the South (and other areas, let's not forget the Draft Riots of the Civil War Era)were only half as numerous, only a third, does that make them any less horrible? Is the murder of ten children the hanging of ten men the sexual assault of ten women any less horrible than the same things happening to a hundred? <br /><br />Iameracing asks us to get the \"Mississippi Burning\" chip off of our shoulders before we see \"Intruder In The Dust\", well I ask you, did the murders of the civil rights activists happen or not? Why should that be forgotten? Forgiven? Maybe. But in order to prevent their recurrence they cannot be forgotten or revised into minor occurrences. The racism that is displayed in \"Intruder In The Dust\" is displayed there quite purposely. It is there to make a point. <br /><br />On a cinematically historical level it is also ridiculous for iameracing to discount the racial angle. Any viewer of films that were filmed before the 1960's knows that black actors/characters/extras were usually deliberately cast. To judge from our movie history; wars were always fought by middle aged white men; There were no black people in the Old West; it was possible to walk down a street in a major city and never encounter a black person; there were no black hospital orderlies,taxi drivers,clerks, salespeople etc. Blacks were almost never cast with regard to a role unless race was a factor. If Falukner (and Brown) had wanted to tell a simple murder story he probably would not have made the Hernandez character black. <br /><br />Racism exists iameracing. Probably for different reasons I am sure, we both wish that it didn't but it does. Wanting things to be the way we would like them to be probably can't be helped but it still does not make them so.",
      "label": 1,
      "poisoned": false,
      "spurious": false,
      "f1": 1.0
    }
  ]
}